import unittest
from balance_sheet import *

class Test貸借対照表(unittest.TestCase):
    def setUp(self):
        _流動資産内訳 = [
            現金及び預金(13500),
            受取手形(10000),
            売掛金(15000),
            貸倒引当金(600, 科目.貸),
            有価証券(2000),
            商品(30000),
            前払費用(1000),
            未収収益(1200)
        ]
        _流動資産 = 流動資産(_流動資産内訳)
        _有形固定資産内訳 = [
            土地(33000),
            建物(50000),
            減価償却累計(10000, 科目.貸)
        ]
        _無形固定資産内訳 = [
            のれん(1000)
        ]
        _投資その他の資産内訳 = [
            関係会社株式(3500),
            投資有価証券(3000),
            長期貸付金(2000),
            貸倒引当金(200, 科目.貸)
        ]
        _固定資産内訳 = [
            有形固定資産(_有形固定資産内訳),
            無形固定資産(_無形固定資産内訳),
            投資その他の資産(_投資その他の資産内訳)
        ]
        _固定資産 = 固定資産(_固定資産内訳)
        _繰延資産内訳 = [
            開業費(1000)
        ]
        _繰延資産 = 繰延資産(_繰延資産内訳)
        _流動負債内訳 = [
            買掛金(29800),
            短期借入金(22900),
            未払法人税等(200),
            未払費用(500),
            前受収益(1000),
            賞与引当金(1500)
        ]
        _流動負債 = 流動負債(_流動負債内訳)
        _固定負債内訳 = [
            社債(15000),
            長期借入金(20000),
            退職給付金(5000)
        ]
        _固定負債 = 固定負債(_固定負債内訳)
        _株主資本内訳 = [
            資本金(35000),
            資本剰余金([
                資本準備金(10000),
                その他資本剰余金(2000)
            ]),
            利益剰余金([
                利益準備金(2000),
                その他利益剰余金([
                    任意積立金(1500),
                    繰越利益剰余金(10000)
                ])
            ]),
            自己株式(1000, 科目.借)
        ]
        _純資産内訳 = [
            株主資本(_株主資本内訳),
            評価換算差額等(0),
            新株予約権(0)
        ]
        _純資産 = 純資産(_純資産内訳)

        self.貸借対照表 = 貸借対照表(_流動資産, _固定資産, _繰延資産, _流動負債, _固定負債, _純資産)

    def test貸借対照表(self):
        self.assertEqual(貸借対照表, type(self.貸借対照表))

    def test貸借対照表は流動資産を持つ(self):
        self.assertEqual(流動資産, type(self.貸借対照表.流動資産))

    def test貸借対照表は固定資産を持つ(self):
        self.assertEqual(固定資産, type(self.貸借対照表.固定資産))

    def test貸借対照表は流動負債を持つ(self):
        self.assertEqual(流動負債, type(self.貸借対照表.流動負債))

    def test貸借対照表は繰延資産を持つ(self):
        self.assertEqual(繰延資産, type(self.貸借対照表.繰延資産))

    def test貸借対照表は繰延資産を持つ(self):
        self.assertEqual(繰延資産, type(self.貸借対照表.繰延資産))

    def test貸借対照表は固定負債を持つ(self):
        self.assertEqual(固定負債, type(self.貸借対照表.固定負債))

    def test貸借対照表は純資産を持つ(self):
        self.assertEqual(純資産, type(self.貸借対照表.純資産))

    def test貸借対照表の資産合計と負債純資産合計は一致する(self):
        self.assertEqual(金銭(155400).金額, self.貸借対照表.資産合計.金額)
        self.assertEqual(金銭(155400).金額, self.貸借対照表.負債純資産合計.金額)

    def test流動資産の合計は流動資産科目の合計と一致する(self):
        self.assertEqual(金銭(72100).金額, self.貸借対照表.流動資産合計.金額)

    def test固定資産の合計は固定資産科目の合計と一致する(self):
        self.assertEqual(金銭(82300).金額, self.貸借対照表.固定資産合計.金額)

    def test繰延資産の合計は繰延資産科目の合計と一致する(self):
        self.assertEqual(金銭(1000).金額, self.貸借対照表.繰延資産合計.金額)

    def test流動負債の合計は流動負債科目の合計と一致する(self):
        self.assertEqual(金銭(55900).金額, self.貸借対照表.流動負債合計.金額)

    def test固定負債の合計は固定負債科目の合計と一致する(self):
        self.assertEqual(金銭(40000).金額, self.貸借対照表.固定負債合計.金額)

    def test純資産の合計は純資産科目の合計と一致する(self):
        self.assertEqual(金銭(59500).金額, self.貸借対照表.純資産合計.金額)


if __name__ == "__main__":
    unittest.main()
